Revit 2027 API
ConductorSize.GetConductorSize Method
 Gets the Conductor Size data by given Conductor Size id.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ConductorSize GetConductorSize(
	Document document,
	ElementId conductorSizeId
)
Public Shared Function GetConductorSize (
	document As Document,
	conductorSizeId As ElementId
) As ConductorSize
public:
static ConductorSize^ GetConductorSize(
	Document^ document,
	ElementId^ conductorSizeId
)
static member GetConductorSize :
        document : Document *
        conductorSizeId : ElementId -> ConductorSize
Parameters
document Document
 The document.
conductorSizeId ElementId
 The Conductor Size id.
Return Value
ConductorSize
 The Conductor Size data.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The id is not a Conductor Size id.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
ConductorSize Class
Autodesk.Revit.DB.Electrical Namespace